#include "BuildObject.h"
#include "ModelRenderer.h"

/****************************************//*
	@brief　	| コンストラクタ
*//****************************************/
CBuildObject::CBuildObject()
{
}

/****************************************//* 
	@brief　	| デストラクタ
*//****************************************/
CBuildObject::~CBuildObject()
{
}

/****************************************//* 
	@brief　	| 初期化処理
*//****************************************/
void CBuildObject::Init()
{
	// 親クラスの初期化処理を呼び出す
	CGameObject::Init();
}