/**************************************************//*
	@file	| CameraTitle.cpp
	@brief	| タイトルカメラクラス実装
*//**************************************************/
#include "CameraTitle.h"

/*****************************************//*
	@brief　	| コンストラクタ
*//*****************************************/
CCameraTitle::CCameraTitle()
{
}

/*****************************************//*
	@brief　	| デストラクタ
*//*****************************************/
CCameraTitle::~CCameraTitle()
{
}

/*****************************************//*
	@brief　	| 初期化処理
*//*****************************************/
void CCameraTitle::Init()
{
	// カメラの位置を設定
	m_f3Pos = DirectX::XMFLOAT3(0.0f, 10.0f, -30.0f);
	// 注視点を設定
	m_f3Look = DirectX::XMFLOAT3(0.0f, 0.0f, 0.0f);
}

/*****************************************//*
	@brief　	| 更新処理
*//*****************************************/
void CCameraTitle::Update()
{
	// タイトルシーンではカメラは固定なので更新処理は不要
}