/**********************************************************************************//*
	@file		| Enums.h
	@brief		| 列挙型定義
*//***********************************************************************************/
#pragma once

/*************************//*
@brief		|シーンの種類
@param[0]	| タイトルシーン
@param[1]	| ゲームシーン
*//*************************/
enum class SceneType
{
	Title,
	Game,
	MAX,
};

/*************************//*
@brief		|トランジションの種類
@param[0]	| フェード
*//*************************/
enum class TransitionType
{
	Fade,		// フェード
	MAX,
};
