/**************************************************//*
	@file	| Item.cpp
	@brief	| アイテムクラス実装
	@note	| アイテムに関する情報を管理するクラスの実装
*//**************************************************/
#include "Item.h"

/****************************************//*
	@brief　	| コンストラクタ
	@param　	| In_eType：アイテムタイプ
*//****************************************/
CItem::CItem(ITEM_TYPE In_eType)
	: m_eItemType(In_eType)
{
}

/****************************************//*
	@brief　	| デストラクタ
*//****************************************/
CItem::~CItem()
{
}