/**************************************************//*
	@file	| Wolf.cpp
	@brief	| オオカミクラスのcppファイル
	@note	| オオカミクラスを実装
			| CAnimalを継承
*//**************************************************/
#include "Wolf.h"

/*****************************************//*
	@brief　	| コンストラクタ
*//*****************************************/
CWolf::CWolf()
	: CAnimal()
{
	// 脅威度の初期化
	m_fThreat = ThreatLevels::Wolf;
}

/*****************************************//*
	@brief　	| デストラクタ
*//*****************************************/
CWolf::~CWolf()
{
}

/*****************************************//*
	@brief　	| 更新処理
*//*****************************************/
void CWolf::Update()
{
	// 基底クラスの更新処理
	CAnimal::Update();
}